// ডিটেইলস : জাভাস্ক্রিপ্টে টার্নারি অপারেটর হলো একটি শর্টহ্যান্ড মেথড যা শর্টলিনের মাধ্যমে কোনো শর্তের উপর ভিত্তি করে একটি মান return করে। এটি সাধারণত if-else স্টেটমেন্টের পরিবর্তে ব্যবহার করা হয় যখন একটি শর্তের উপর ভিত্তি করে একটি মান নির্ধারণ করতে হয়। টার্নারি অপারেটর তিনটি অংশ নিয়ে গঠিত: শর্ত, সত্য হলে মান, এবং মিথ্যা হলে মান।


let age = 18;

// টার্নারি অপারেটর ব্যবহার করে বয়সের উপর ভিত্তি করে টাইপ নির্ধারণ করা হচ্ছে
let type = age >= 18 ? "Adult" : age <= 12 ? "Child" : "Teenager";

console.log(type);  