// কোডের মধ্যে যদি আমরা কোন ফাংশনে অনেকগুলো আর্গুমেন্ট পাস করি তাহলে আমরা রেস্ট অপারেটর ব্যবহার করতে পারি। রেস্ট অপারেটর হলো তিনটি ডট (...), এটি ফাংশনের প্যারামিটার হিসেবে ব্যবহৃত হয় এবং এটি ফাংশনে পাস করা অতিরিক্ত আর্গুমেন্টগুলিকে একটি অ্যারে হিসেবে গ্রহণ করে। যেমন নিচের উদাহরণে আমরা একটি ফাংশন তৈরি করেছি যার নাম sum, এই ফাংশনে প্রথম প্যারামিটার হিসেবে একটি নাম নেওয়া হয়েছে এবং তারপর রেস্ট অপারেটর ব্যবহার করে অতিরিক্ত আর্গুমেন্টগুলোকে args নামে একটি অ্যারে হিসেবে গ্রহণ করা হয়েছে। যখন আমরা sum ফাংশনকে কল করি এবং অনেকগুলো আর্গুমেন্ট পাস করি, তখন args অ্যারেতে সেই আর্গুমেন্টগুলো সংরক্ষিত হয় এবং আমরা তা কনসোলে দেখতে পারি। 


function sum(name, ...args) {
    console.log(args);
    console.log(name);
}

sum('Sajed', 1, 2, 3, 4, 5); 



